// Задача 4: Напишите программу, которая 
// принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
// комментарий - использовать логику задачи про гирю

Console.WriteLine("Введите первое число ");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число ");
int numberB = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите третье число ");
int numberС = Convert.ToInt32(Console.ReadLine());
int max = numberA;
if (numberB > max) (numberB > numberС)
{
    Console.Write("numberB");

}
if (numberС > max)| (numberC > numberB){,
    Console.Write("numberC");
}
else
{
    Console.WriteLine("numberA");
}

